Revit 2024 API
BuiltInFailures.MEPCalculationFailures.ClassificationNotSetInFamily Property
 A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ClassificationNotSetInFamily { get; }
Visual Basic
Public Shared ReadOnly Property ClassificationNotSetInFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ClassificationNotSetInFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace